/* --------------------------------------------------------------------------
### Задача №2 ###
-----------------------------------------------------------------------------
Реализуйте метод, принимающий в качестве аргумента целочисленный массив.
Если длина массива меньше некоторого заданного минимума, метод возвращает -1,
в качестве кода ошибки, иначе - длину массива.
-------------------------------------------------------------------------- */

public class Main {
    public static void main(String[] args) {
        Main program = new Main();
        program.run();
    }

    public void run() {
    }
}